docs/emacs/ibuffer-keybindings.html
<!doctype html>
<html lang="en">
<head>
<title>IBUFFER keybindings</title>
<!-- 2023-02-23 Thu 08:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Gardner Berry">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-">The Problem</a></li>
<li><a href="#sec-">The Solution</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">IBUFFER keybindings</h1>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">The Problem</h2>
<div class="outline-text-2" id="text-">
<p>
I use DOOM Emacs as my configuration frame work, and it uses IBUFFER to manage the buffers. The keybindings that are used in IBUFFER are the same as the standard Text manipulation keys. So J and K are up and down like normal but L and H just move you from side to side in the buffer. So now this brings me to my problem, I wanted to make it so that when I press L it will enter the buffer. When I tried to google this I found no documentation. so I went to the DOOM Emacs discord and asked for help, and the lead maintainer of DOOM spent around 10 minutes replying. So as discords are black holes for information I am putting this on my blog in an attempt to preserve it.
</p>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">The Solution</h2>
<div class="outline-text-2" id="text-">
<p>
Keybindings in Emacs can be a bit complicated, but here&rsquo;s my attempt to lay out the steps to binding a key:
</p>

<ol class="org-ol">
<li>Identify what (major or minor) mode you want to associate your new keybind with. C-h m can give you information about currently active modes in the current buffer. Or you can look up the value of the major-mode variable: C-h v major-mode. This should tell you ibuffer-mode.
</li>
<li>Identify the keymap variable associated with ibuffer-mode is (conventionally, that&rsquo;s {mode-name}-map, but sometimes it&rsquo;s {mode-name}-keymap). You can search variables with C-h v ^ibuffer-mode. You&rsquo;ll eventually find ibuffer-mode-map.
</li>
<li>Identify the package that this keymap variable is defined in. C-h v ibuffer-mode-map will tell you it&rsquo;s defined in a ibuffer.el file, and the package name is often just the name of the file minus the extension: ibuffer.
</li>
<li>Identify what command you want to execute when you press l. One may already exist; like C-h v, you can use C-h x to search all known commands. Or even better: since you already know the enter key does what you want, type C-h k then press enter key. This gives you documentation about the command bound to enter: ibuffer-visit-buffer.
</li>
<li>Finally, bind the new key on the keymap variable (#2) to the command (#4), after the package (#3) is loaded. Doom provides the map! macro to do all this in one go:
</li>
</ol>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5B6268; font-style: italic;">;; </span><span style="color: #5B6268; font-style: italic;">in Doom</span>
<span style="color: #51afef;">(</span><span style="color: #51afef; font-style: italic;">map!</span> <span style="color: #c678dd;">:after</span> ibuffer
      <span style="color: #c678dd;">:map</span> <span style="color: #dcaeea;">ibuffer-mode-map</span>
      <span style="color: #98be65;">"l"</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">ibuffer-visit-buffer</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
However, there may be cases where this won&rsquo;t work. Use C-h k to debug that. In this case, it&rsquo;ll tell you that this key is bound to evil-forward-char, not ibuffer-visit-buffer. That&rsquo;s because evil (vim-emulated) keybinds have precedence over non-evil ones. The quick fix: make your keybinding an evil keybind:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"> <span style="color: #5B6268; font-style: italic;">;; </span><span style="color: #5B6268; font-style: italic;">in Doom</span>
 <span style="color: #51afef;">(</span><span style="color: #51afef; font-style: italic;">map!</span> <span style="color: #c678dd;">:after</span> ibuffer
       <span style="color: #c678dd;">:map</span> <span style="color: #dcaeea;">ibuffer-mode-map</span>
-      <span style="color: #98be65;">"l"</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">ibuffer-visit-buffer</span><span style="color: #51afef;">)</span>
+      <span style="color: #c678dd;">:n</span> <span style="color: #98be65;">"l"</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">ibuffer-visit-buffer</span><span style="color: #ff6c6b; font-weight: bold;">)</span>
</pre>
</div>

<p>
The :n binds it to normal mode on ibuffer-mode-map.
</p>

<p>
These precedence rules aren&rsquo;t very obvious, and there&rsquo;s a lot of detective work involved for more complex cases, but that should roughly outline the kind of issues you&rsquo;re going to run into most.
</p>

<p>
Hope that helps!
</p>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Gardner Berry</p>
<p class="date">Created: 2023-02-23 Thu 08:01</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>